org/_posts/2016-04-11-frequentism-vs-bayesianism.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+BEGIN_HTML
---
layout: post
title: "Frequentism vs Bayesianism"
date: 2016-04-11
comments: true
archive: true
notes: true
tags: notes
excerpt: Thoughts regarding the subtle differences between Frequentism and Bayesianism.
---
#+END_HTML

The disagreement between *Frequentism* and *Bayesianism* concerns the
definition of probability.

*Frequentism* interprets probability as the limiting case of repeated
measurements.

probabilites = fundamentally related frequency of any given value

*Bayesianism* interprets probability as degrees of certainty about
 statements.

probability = fundamentally related to our knowledge about an event

probability = statement of my knowledge of what the measurement result
will be

*Example:* Given a measurements of a photon flux $F$ from a given star
 estimate the true flux of the star.

| Different views                |   |   |   |            |
|--------------------------------+---+---+---+------------|
|                                |   |   |   | <10>       |
| *Frequentist view:*            |   |   |   | Since by definition the probability of the true flux of a star is a fixed value then it is meaningless for the frequentist to talk about the probability. Talking about frequency distribution for a fixed value is nonsense. |
| *Bayesian view:*               |   |   |   | Claims to measure the flux $F$ of a star with some probability $P(F)$. Although the probability can be estimated from frequencies of repeated experiments it is not fundamental. |
|                                |   |   |   | Can meaningfully talk about the probability that the true flux of a star lies in a given range |
|                                |   |   |   | Probability codifies our knowledge of the value based on prior information and/or available data |
| Philosophy difference leads to |   |   |   | different approaches to statistical analysis of data |


~An example illustrating the different approaches:~

_Notation:_

$N$ = measurements

$i^{th}$ = observation

$F_{i}$ = photon flux

$e_{i}$ = error related to $F_{i}$


Assumptions regarding $e_{i}$: $e_{i}$ \distas N(\mu, \sigma^{2})$
