_posts/2016-04-11-frequentism-vs-bayesianism.html
---
layout: post
title: "Frequentism vs Bayesianism"
date: 2016-04-11
comments: true
archive: true
notes: true
tags: notes
excerpt: Thoughts regarding the subtle differences between Frequentism and Bayesianism.
---

<p>
The disagreement between <b>Frequentism</b> and <b>Bayesianism</b> concerns the
definition of probability.
</p>

<p>
<b>Frequentism</b> interprets probability as the limiting case of repeated
measurements.
</p>

<p>
probabilites = fundamentally related frequency of any given value
</p>

<p>
<b>Bayesianism</b> interprets probability as degrees of certainty about
 statements.
</p>

<p>
probability = fundamentally related to our knowledge about an event
</p>

<p>
probability = statement of my knowledge of what the measurement result
will be
</p>

<p>
<b>Example:</b> Given a measurements of a photon flux \(F\) from a given star
 estimate the true flux of the star.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Different views</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Frequentist view:</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Since by definition the probability of the true flux of a star is a fixed value then it is meaningless for the frequentist to talk about the probability. Talking about frequency distribution for a fixed value is nonsense.</td>
</tr>

<tr>
<td class="org-left"><b>Bayesian view:</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Claims to measure the flux \(F\) of a star with some probability \(P(F)\). Although the probability can be estimated from frequencies of repeated experiments it is not fundamental.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Can meaningfully talk about the probability that the true flux of a star lies in a given range</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">Probability codifies our knowledge of the value based on prior information and/or available data</td>
</tr>

<tr>
<td class="org-left">Philosophy difference leads to</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">different approaches to statistical analysis of data</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>



<p>
<code>An example illustrating the different approaches:</code>
</p>

<p>
<span class="underline">Notation:</span>
</p>

<p>
\(N\) = measurements
</p>

<p>
\(i^{th}\) = observation
</p>

<p>
\(F_{i}\) = photon flux
</p>

<p>
\(e_{i}\) = error related to \(F_{i}\)
</p>


<p>
Assumptions regarding \(e_{i}\): \(e_{i}\) \distas N(&mu;, &sigma;<sup>2</sup>)$
</p>
